Revit 2027 API
BuiltInFailures.ElectricalFailures.CableTrayModified Property
 The cable tray has been modified to be in the opposite direction or insufficient space to create the required fittings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CableTrayModified { get; }
Public Shared ReadOnly Property CableTrayModified As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CableTrayModified {
	FailureDefinitionId^ get ();
}
static member CableTrayModified : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace